Repository: whelks-chance/wiserd3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: Your profile contains details about you and your settings, as well as the toggle at the top of each page you can set your language preference here. Your preference will be stored and used each time you log into the DataPortal. Always remember to click Save when you have updated your profile/settings.
cy: Mae eich proffil yn cynnwys manylion amdanoch chi a'ch gosodiadau, yn ogystal â'r togl ar frig pob tudalen a gallwch osod eich dewis iaith yma. Bydd eich dewis yn cael ei storio a'i ddefnyddio bob tro y byddwch yn mewngofnodi i'r DataPortal. Cofiwch glicio ar Arbed pan fyddwch wedi diweddaru eich proffil/gosodiadau.

source: Browse Surveys is an easy to use overview listing all the surveys the DataPortal has to offer. On this page you can filter the surveys and view their content.
cy: Mae Pori Arolygon yn drosolwg hawdd ei ddefnyddio sy'n rhestru'r holl arolygon sydd gan y DataPortal i'w cynnig. Ar y dudalen hon gallwch hidlo'r arolygon a gweld eu cynnwys.

source: Datasets can be found and searched through the Search Metadata button, or simply by using the search bar on the left hand side of the DataPortal.
cy: Gellir dod o hyd i setiau data a'u chwilio drwy'r botwm Chwilio Metadata, neu drwy ddefnyddio'r bar chwilio ar ochr chwith y DataPortal.

source: When searching a keyword such as Health, all related questions, surveys and qualitative records will be displayed.
cy: Wrth chwilio am air allweddol fel Iechyd, bydd yr holl gwestiynau, arolygon a chofnodion ansoddol yn cael eu dangos.

source: These results appear in a grid format which can be filtered between Questions, Surveys and Qualitative Records. You can also use the search bars at the top of each subsection to search through the results as well as sorting the results by clicking on a column headings (for example sorting by date).
cy: Mae'r canlyniadau hyn yn ymddangos ar ffurf grid y gellir eu hidlo rhwng Cwestiynau, Arolygon a Chofnodion Ansoddol. Gallwch hefyd ddefnyddio'r bariau chwilio ar frig pob isadran i chwilio drwy'r canlyniadau yn ogystal â didoli'r canlyniadau drwy glicio ar benawdau colofnau (er enghraifft didoli yn ôl dyddiad).

source: Once you've found data of interest to you there are two options, View Question or View Survey.
cy: Ar ôl i chi ddod o hyd i ddata sydd o ddiddordeb i chi mae dau opsiwn, Gweld y Cwestiwn neu Gweld yr Arolwg.

source: View Question will bring up this page.
cy: Bydd Gweld y Cwestiwn yn dangos y dudalen hon.

source: This page gives you information about the question
cy: Mae'r dudalen hon yn rhoi gwybodaeth i chi am y cwestiwn.

source: By clicking on the tabs at the top of each page you can see the Response information and the Response table.
cy: Trwy glicio ar y tabiau ar frig pob tudalen gallwch weld y wybodaeth Ymateb a'r tabl Ymateb.

source: The Survey button will open the following page.
cy: Bydd y botwm Arolwg yn agor y dudalen ganlynol.

source: The Dublin Core, this page provides all the metadata about the survey as a whole. They may provide information on who produced the survey, how the survey data was collected, how many people responded and how to obtain the response data. The <b>Source URL</b> will take you to the downloadable data.
cy: Craidd Dulyn, mae'r dudalen hon yn darparu'r holl fetadata am yr arolwg yn ei gyfanrwydd. Gallant ddarparu gwybodaeth am bwy gynhyrchodd yr arolwg, sut y casglwyd data'r arolwg, faint o bobl wnaeth ymateb a sut i gaffael y data ymateb. Bydd yr<b>URL Ffynhonnell</b> yn mynd â chi i'r data y gellir eu lawrlwytho.

source: The Survey page provides all the information about the survey itself, some information included here is the survey title, the start and end dates of the survey and the sample size.
cy: Mae'r dudalen Arolwg yn darparu'r holl wybodaeth am yr arolwg ei hun, a pheth o'r wybodaeth sydd wedi'i chynnwys yma yw teitl yr arolwg, dyddiadau dechrau a gorffen yr arolwg a maint y sampl.

source: The questions page provides you with all the questions that were included in the survey and links to view each sepereate question.
cy: Mae'r dudalen gwestiynau yn rhoi yr holl gwestiynau i chi a gafodd eu cynnwys yn yr arolwg a lincs i weld pob cwestiwn unigol.

source: The search page offers 3 different sections of results, by clicking the Survey tab you can search through the survey section, this offer different functions to the questions section.
cy: Mae'r dudalen chwilio yn cynnig 3 adran wahanol o ganlyniadau, drwy glicio'r tab Arolygon gallwch chwilio drwy adran yr arolwg, mae hwn yn cynnig gwahanol swyddogaethau i'r adran gwestiynau.

source: The DataPortal provides a simple way of mapping data you have found quickly and easily by clicking the Map Survey button.
cy: Mae'r DataPortal yn cynnig ffordd syml o fapio data yr ydych wedi eu canfod yn gyflym ac yn hawdd drwy glicio ar y botwm Mapio Arolwg.

source: Once you have clicked this button it will take you to the map page and ask you to choose some data in order to present the information.
cy: Ar ôl i chi glicio ar y botwm hwn bydd yn mynd â chi at y dudalen fap a gofyn i chi ddewis data er mwyn cyflwyno'r wybodaeth.

source: By clicking
cy: Trwy glicio

source: the survey data is added to the map. as you can see a key for the data has been added.
cy: bydd data'r arolwg yn cael ei ychwanegu at y map. Fel y gwelwch mae allwedd ar gyfer y data wedi cael ei hychwanegu.

source: On clicking the View Map button DataPortal is directed to this page - an interactive mapping section. DataPortal gives the user the ability to plot information on a map, making the data easier to visualise and sort.
cy: Wrth glicio'r botwm Gweld y Map mae'r DataPortal yn cael ei chyfeirio i'r dudalen hon - adran fapio ryngweithiol. Mae'r DataPortal yn rhoi'r gallu i'r defnyddiwr i osod gwybodaeth ar fap, gan wneud y data yn hawdd i'w deall a'u didoli.

source: The interface:
cy: Y rhyngwyneb:

source: This is the starting page where a user can insert data onto a map to be analysed further. The familiar sidebar contains the dashboard button, options for importing data onto the map using layers, and Recent Search Results which is a quick way of adding previously used data. The layer button (located in the top right hand corner of the map, allows the user to select layers to view or hide.
cy: Dyma'r dudalen gychwyn lle gall defnyddiwr roi data ar fap i'w dadansoddi ymhellach. Mae'r bar ochr cyfarwydd yn cynnwys botwm y dangosfwrdd, opsiynau ar gyfer mewnforio data i'r map gan ddefnyddio haenau, a Chanlyniadau Chwiliadau Diweddar sy'n ffordd gyflym o ychwanegu data a ddefnyddiwyd yn flaenorol. Mae'r botwm haen (ar frig y map yn y gornel dde) yn caniatau i'r defnyddiwr ddewis haenau i'w gweld neu eu cuddio.

source: The WISERD DataPortal can be used to find and map a variety of socio-economic data, points of interest and boundary data for Wales. You can then export the map and download the data for further analysis.
cy: Gellir defnyddio DataPortal WISERD i ddod o hyd i amrywiaeth o ddata cymdeithasol-economaidd, mannau o ddiddordeb a data ffiniau i Gymru, yn ogystal â'u mapio. Yna gallwch allforio'r map a lawrlwytho'r data i'w dadansoddi ymhellach.

source: To add remote data to the map, click on the Map Layers button and select Remote Data.
cy: I ychwanegu data o bell at y map, cliciwch ar y botwm Haenau Map a dewiswch Data o Bell.

source: The following search box will appear, by typing in a key word different datasets will appear. Select any dataset of interest and click Add to Map.
cy: Bydd y blwch chwilio canlynol yn ymddangos, trwy deipio gair allweddol bydd gwahanol setiau data yn ymddangos. Dewiswch unrhyw set ddata o ddiddordeb a chliciwch Ychwanegu at y Map.

source: A list of variables will appear, these help divide the data into meaningful layers, for example, choosing Very Good Health, Annually as a Percent in Total by LSOA. Click
cy: Bydd rhestr o newidynnau yn ymddangos, mae'r rhain yn helpu i rannu'r data yn haenau ystyrlon, er enghraifft, dewis Iechyd Da Iawn, yn Flynyddol fel Canran mewn Cyfanswm yn ôl LSOA.

source: Render to Map.
cy: Rendro i’r map

source: One common error that may occur is shown below, if you see this error it means you haven't selected enough variables. The error box will list all the variables that have not been chosen to help you select the correct ones.
cy: Dangosir un gwall cyffredin a allai ddigwydd isod, os gwelwch y gwall hwn mae'n golygu nad ydych wedi dewis digon o newidynnau. Bydd y blwch gwallau yn dangos yr holl newidynnau nad ydynt wedi cael eu dewis i'ch helpu i ddewis y rhai cywir.

source: The following box will show
cy: Bydd y blwch canlynol yn dangos

source: Choropleth Options
cy: Dewisiadau choropleth

source: (these are the visual features of the layer) select the desired options and click
cy: (rhain yw nodweddion gweledol yr haen) dewiswch yr opsiynau a ddymunir a chliciwch

source: Show New Layer.
cy: Dangos Haen Newydd

source: The following will be displayed. The key at the bottom of the map shows the different percentages of very good health in different regions.
cy: Bydd y canlynol yn cael ei ddangos. Mae'r allwedd ar waelod y map yn dangos y gwahanol ganrannau o iechyd da iawn mewn gwahanol ranbarthau.

source: From this map you can select a region and find out information about it in the righthand sidebar (example shown below).
cy: O'r map hwn gallwch ddewis rhanbarth a chael gwybodaeth amdano yn y bar ochr ar y dde (dangosir enghraifft isod).

source: A box will appear where you can choose a local file to upload onto the map. The following box will display the fields available to display on the map.
cy: Bydd blwch yn ymddangos lle y gallwch ddewis ffeil leol i'w llwytho i'r map. Bydd y blwch canlynol yn dangos y meysydd sydd ar gael i'w dangos ar y map.

source: You must select the Choropleth options so that your data can be displayed correctly and name the layer. Once
cy: Rhaid i chi ddewis yr opsiynau Choropleth er mwyn i'ch data gael eu dangos yn gywir ac enwi'r haen. Unwaith y bydd

source: is clicked the data will be displayed on the map including a key on the righthand side.
cy: yn cael ei glicio bydd y data yn cael eu dangos ar y map yn cynnwys allwedd ar yr ochr dde.

source: This will remain on the map until you choose to delete it. To turn the layer off use the
cy: Bydd hwn yn aros ar y map tan i chi ddewis ei ddileu. I droi'r haen i ffwrdd defnyddiwch y

source: Layer Manager
cy: Enw’r Haen

source: (the brown icon in the top right hand corner of the map).
cy: (yr eicon brown ar frig y map yn y gornel dde).

source: As part of our work with the National Assembly for Wales, a bespoke interface has been developed for the WISERD DataPortal which allows Assembly research staff, Assembly Members and their support staff to access and map a wide range of data for National Assembly for Wales Constituencies and Regions.
cy: Fel rhan o'n gwaith gyda Chynulliad Cenedlaethol Cymru, mae rhyngwyneb at y diben wedi cael ei ddatblygu ar gyfer y DataPortal WISERD sy'n caniatau i staff ymchwil y Cynulliad, Aelodau'r Cynulliad a'u staff cymorth i gael mynediad at amrediad eang o ddata ar gyfer Etholaethau a Rhanbarthau Cynulliad Cenedlaethol Cymru a'u mapio.

source: This section displays all the Events that the DataPortal team has attended and the event presentations. The presentations are also available to download.
cy: Mae'r adran hon yn dangos yr holl Ddigwyddiadau y mae tîm y DataPortal wedi'u mynychu a chyflwyniadau'r digwyddiadau. Mae'r cyflwyniadau hefyd ar gael i'w lawrlwytho.

source: On clicking this button a new tab will open displaying the technical blog. The DataPortal is constantly being updated and improved, so the technical blog gives an insight into the behind-the-scenes workings of the DataPortal.
cy: Wrth glicio ar y botwm hwn bydd tab newydd yn agor gan ddangos y blog technegol. Mae'r DataPortal yn cael ei diweddaru a'i gwella o hyd, felly mae'r blog technegol yn cynnig cipolwg ar weithrediadau cefndirol y Porth Data.

source: Help using the DataPortal (such as this downloadable guide), licensing agreements and contact information of support can be found on this page along with a log of any changes to the DataPortal.
cy: Mae cymorth gyda defnyddio'r DataPortal (fel y canllaw hwn y gellir ei lawrlwytho), cytundebau trwyddedu a gwybodaeth gyswllt cymorth ar gael ar y dudalen hon ynghyd â log o unrhyw newidiadau i'r DataPortal.

source: Welcome
cy: Croeso

source: Thank you for signing up to the WISERD DataPortal
cy: Diolch i chi am gofrestru ar WISERD DataPortal

source: It looks like you have a valid National Assembly for Wales email address, but you haven't confirmed it in the email we sent you.
cy: Mae’n ymddangos bod gennych gyfeiriad e-bost cymwys Cynulliad Cenedlaethol Cymru, ond nid ydych wedi’i gadarnhau yn yr e-bost a anfonwyd atoch.

source: Please follow the link in the email to gain access to the NAW Dashboard features.
cy: Dilynwch y linc yn y neges e-bost i gael defnyddio nodweddion Dangosfwrdd y Cynulliad.

source: If you haven't received a confirmation email
cy: Os nad ydych wedi cael neges e-bost i gadarnhau

source: Click here
cy: Cliciwch yma

source: Please tell us more about yourself
cy: Dywedwch ragor wrthym amdanoch eich hun

source: English
cy: Saesneg

source: Welsh
cy: Cymraeg
