Repository: whelks-chance/wiserd3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: A complete rewrite of the back end to use Yii
cy: Ailysgrifennu’r cefn i gyd i ddefnyddio Yii

source: User registration and login fixed
cy: Atgyweirio cofrestru a mewngofnodi defnyddiwr

source: Search efficiency optimised
cy: Gwella effeithlonrwydd chwilio

source: Logging added
cy: Ychwanegu logio

source: Updated OpenLayers to v2.12
cy: Diweddaru OpenLayers i v2.12

source: Account and Password management updated
cy: Diweddaru rheoli cyfrif a chyfrinair

source: Early 2012
cy: Dechrau 2012

source: The initial release of the WISERD GeoPortal at University of Glamorgan
cy: Rhyddhau WISERD DataPortal am y tro cyntaf ym Mhrifysgol Morgannwg

source: Language
cy: Iaith

source: Select your preferred language.
cy: Dewiswch iaith.

source: Licences and Attributions
cy: Trwydded a Phriodoliad

source: Unless otherwise noted, the data and information available through the WISERD DataPortal is public sector information released under the Open Government Data License. The following accepted <a class="c0" target="_blank" href="http://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/">generic attribution</a> relating to the use of such data and information from various sources has been applied where appropriate.
cy: Oni nodir yn wahanol, gwybodaeth o'r sector cyhoeddus a ryddhawyd o dan y Drwydded Data Llywodraeth Agored yw'r data a'r wybodaeth sydd ar gael drwy WISERD DataPortal. Isod, mae'r <a class="c0" target="_blank" href="http://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/">gydnabyddiaeth gyffredinol</a> y cytunwyd arni ar gyfer defnyddio'r fath ddata a gwybodaeth o ffynonellau amrywiol. Defnyddir y gydnabyddiaeth hon lle y bo'n briodol.

source: &lsquo;Contains public sector information licensed under the Open Government Licence v3.0&rsquo;.
cy: &lsquo;Yn cynnwys gwybodaeth sector cyhoeddus a drwyddedwyd o dan Drwydded Llywodraeth Agored v3.0 Licence v3.0&rsquo;.

source: This attribution can be expanded to include any or all of the following organisations, sources and attributions under the Open Government Licence.
cy: Gellir ehangu'r gydnabyddiaeth hon i gynnwys unrhyw un, neu bob un, o'r sefydliadau, y ffynonellau a'r cydnabyddiaethau a ganlyn o dan y Drwydded Llywodraeth Agored.

source: Welsh Government
cy: Llywodraeth Cymru

source: Sources:
cy: Ffynhonnell

source: StatsWales
cy: StatsCymru

source: Lle Portal
cy: Porth Lle

source: Attribution: &copy; Crown copyright <span class="current_year">2016</span>
cy: Cydnabyddiaeth: &copy; Hawlfraint y Goron <span class="current_year">2016</span>

source: Office for National Statistics (ONS)
cy: Y Swyddfa Ystadegau Gwladol (ONS)

source: ONS OpenAPI
cy: API agored y Swyddfa Ystadegau Gwladol

source: Neighbourhood Statistics API
cy: API Ystadegau Cymdogaethau

source: NOMIS API
cy: API NOMIS

source: Attribution:
cy: Cydnabyddiaeth:

source: Contains National Statistics data &copy; Crown copyright and database right <span class="current_year">2016</span>
cy: Yn cynnwys data Ystadegau Gwladol &copy; Hawlfraint a hawl cronfa ddata'r Goron <span class="current_year">2016</span>

source: Electoral Commission
cy: Y Comisiwn Etholiadol

source: Attribution: &copy; <span class="current_year">2016</span> The Electoral Commission
cy: Cydnabyddiaeth: &copy; <span class="current_year">2016</span> Y Comisiwn Etholiadol

source: Ordnance Survey
cy: Arolwg Ordnans

source: Attribution: Contains Ordnance Survey data &copy; Crown copyright and database right <span class="current_year">2016</span>
cy: Cydnabyddiaeth: Yn cynnwys data Arolwg Ordnans &copy; Hawlfraint a hawl cronfa ddata'r Goron <span class="current_year">2016</span>

source: Attribution: Map data &copy;&nbsp;
cy: Cydnabyddiaeth: Data mapiau &copy;&nbsp;

source: contributors,&nbsp;
cy: cyfranwr,&nbsp;

source: Source code available at <a class="c0" target="_blank" href="https://github.com/whelks-chance/wiserd3">GitHub</a>.
cy: Cod ffynhonnell ar gael yn <a class="c0" target="_blank" href="https://github.com/whelks-chance/wiserd3">GitHub</a>.

source: Local Data
cy: Data Lleol

source: Map layers
cy: Haenau map

source: Remote Data
cy: Data o Bell

source: MapMyData
cy: MapioFyNata

source: Welsh Government Mapping Service
cy: Gwasanaeth Mapio Llywodraeth Cymru

source: WISERD Knowing Localities Research
cy: Ymchwil Gwybod Lleoliadau WISERD

source: Region Data
cy: Data Rhanbarth

source: VALUE
cy: GWERTH

source: Sorry, an error occurred. \n\n
cy: Mae’n ddrwg gennym, cafwyd gwall. \n\n

source: It looks like your query was too specific, for example, when data are suppressed due to statistical confidentiality considerations. \n\n
cy: Mae’n edrych fel fod eich ymholiad yn rhy benodol, er enghraifft pan gaiff data eu hatal oherwydd ystyriaethau cyfrinachedd ystadegol. \n\n

source: In this case, try a larger area to map data for.
cy: Yn yr achos hwn, rhowch gynnig ar ardal fwy i fapio data ar ei chyfer.

source: No data could be found for this query. \n\n
cy: Nid oedd yn bosibl dod o hyd i ddata ar gyfer yr ymholiad hwn. \n\n

source: Please try again, or report it.
cy: Rhowch gynnig arall arni, neu rhowch wybod amdano.

source: Unfortunately, some types of dataset are incompatible with this service. \n\n
cy: Yn anffodus, mae rhai mathau o setiau data yn anghyson â’r gwasanaeth hwn. \n\n

source: Try being more specific with the dataset variable you are trying to map. \n\n
cy: Ceisiwch fod yn fwy penodol am yr amrywiad set data rydych yn ceisio’i fapio. \n\n

source: Or, it may be the case that your query was too specific. For example, when data are suppressed due to statistical confidentiality considerations.
cy: Neu, efallai bod eich ymholiad yn rhy benodol. Er enghraifft, pan gaiff data eu hatal oherwydd ystyriaethau cyfrinachedd ystadegol.

source: Screenshot
cy: Sgrinlun

source: Reset
cy: Ailosod

source: Show New Layer
cy: Dangos Haen Newydd

source: Cancel
cy: Canslo

source: Searching NomisWeb/ StatsWales...
cy: Chwilio drwy NomisWeb/Ystadegau Cymru...

source: Sorry, an error occurred. Please try again, or report it.\n\n
cy: Mae’n ddrwg gennym, cafwyd gwall. Rhowch gynnig arall arni, neu rhowch wybod amdano.\n\n

source: Sorry, no results were found for that search.\n
cy: Mae’n ddrwg gennym, ni chafwyd canlyniadau ar gyfer y chwilio hwnnw.\n

source: Please refine the search terms and try again
cy: Addaswch eich ymadrodd chwilio a rhowch gynnig arall arni

source: Learn More
cy: Dysgwch ragor

source: Add to Map
cy: Ychwanegu at y map

source: Render to Map
cy: Rendro i’r map

source: Geography
cy: Daearyddiaeth

source: Please select an option for each selection :
cy: Dewiswch opsiwn ar gyfer pob detholiad:

source: Save
cy: Cadw

source: Select geography id column
cy: Dewis colofn dynodydd daearyddol

source: Select data value column
cy: Dewis y golofn gwerth data

source: Select additional secondary data
cy: Dewis data eilaidd ychwanegol

source: Choropleth options
cy: Dewisiadau choropleth

source: Category Types
cy: Mathau o gategorïau

source: Equal size categories
cy: Categorïau o’r un maint

source: Quantiles
cy: Cwantelau

source: Number of Categories
cy: Nifer y Categorïau

source: Choropleth colour scheme
cy: Cynllun lliwiau choropleth

source: Orange - Red
cy: Oren - Coch

source: Red - Yellow - Blue
cy: Coch – Melyn - Glas

source: Yellow - Green - Blue
cy: Melyn – Gwyrdd - Glas

source: Spectral
cy: Sbectrol

source: Greyscale
cy: Graddlwyd

source: Layer Name
cy: Enw’r Haen

source: Dataset Variables
cy: Amrywiadau Set Ddata

source: Welcome
cy: Croeso

source: Welcome to the WISERD DataPortal.<br><br>For more information, follow this tutorial.
cy: Croeso i'r DataPortal WISERD.<br><br>Am ragor o wybodaeth, dilynwch y tiwtorial hwn.

source: Links to help and support links and PDF downloads here.
cy: Lincs i lincs cymorth a chefnogaeth a dogfennau PDF i'w lawrlwytho yma.

source: Search Remote
cy: Chwilio o Bell

source: Search...
cy: Chwilio...

source: The WISERD DataPortal allows users to map their own data for areas in Wales and to export this as a publishable map. This function has been specially designed so that all the mapping occurs inside the users browser rather than on the WISERD DataPortal server. This means that potentially sensitive data does not leave the users machine.
cy: Mae'r DataPortal WISERD yn caniatau i ddefnyddwyr fapio eu data eu hunain ar gyfer ardaloedd yng Nghymru ac i allforio hyn fel map y gellir ei gyhoeddi. Mae'r swyddogaeth hon wedi cael ei chynllunio'n arbennig fel bod yr holl fapio yn digwydd y tu mewn i borwr y defnyddiwr yn hytrach nag ar weinydd DataPortal WISERD. Mae hyn yn golygu nad yw data a allai fod yn sensitif yn gadael peiriant y defnyddiwr.

source: You can import your own data onto the DataPortal by clicking the MapMyData button.
cy: Gallwch fewnforio eich data eich hun i'r DataPortal drwy glicio ar y botwm MapioFyNata.

source: Name this Layer
cy: Enwch yr Haen hon

source: New Layer...
cy: Haen Newydd

source: Select boundary type
cy: Dewis math o ffin

source: Toggle navigation
cy: Toglo’r llywio

source: Site Setup
cy: Sefydlu’r Safle

source: Admin Panel
cy: Panel Gweinyddu

source: SQL Explorer
cy: Archwiliwr SQL

source: User Profile
cy: Proffil y Defnyddiwr

source: API Docs
cy: Dogfennau API

source: Logout
cy: Allgofnodi

source: Login
cy: Mewngofnodi

source: Recent Search Results
cy: Canlyniadau Chwilio Diweddar

source: Text Results
cy: Canlyniadau Testun

source: Spatial Results
cy: Canlyniadau Gofodol

source: Surveys
cy: Arolygon

source: Questions
cy: Cwestiynau

source: Stay on this page
cy: Aros ar y dudalen hon

source: Navigate to WISERD HOME
cy: Llywio i HAFAN WISERD

source: WISERD Dashboard
cy: Dangosfwrdd WISERD

source: National Assembly Research Service
cy: Cynulliad Cenedlaethol Y Gwasanaeth Ymchwil

source: "In Brief" Blog
cy: Blog 'Yn Gryno"

source: Research
cy: Ymchwil

source: OpenID Sign In
cy: Mewngofnodi i OpenID

source: Local data layers
cy: Data Lleol

source: Settings
cy: Gosodiadau

source: Links and Tabs
cy: Lincs a Thabiau

source: This is not advised on mobile, as tab management is not as easy as when using a desktop browser.
cy: Nid ydym yn argymell hyn ar ddyfeisiadau symudol, gan nad yw mor hawdd rheoli tabiau ag ydyw wrth ddefnyddio porwr pen desg.

source: However it can be desirable to have multiple tabs open to view multiple surveys, for example.
cy: Ond, gall fod yn ddymunol gadael nifer o dabiau ar agor i weld mwy nag un arolwg, er enghraifft.

source: Open links in new tabs
cy: Agor lincs mewn tabiau newydd

source: Choropleth Speed/ Quality
cy: Cyflymder/Ansawdd Chloropleth

source: Using high resolution regions, generating a choropleth can be very strenuous for your browser and also requires larger downloads.
cy: Wrth ddefnyddio rhanbarthau lliwiau cryf, gall cynhyrchu chloropeth roi pwysau ar eich porwr a bydd golygu llwytho dogfennau mwy.

source: For this reason, the TopoJSON layer used is "simplified" down to 1%% complexity for speed and ease of use.
cy: Felly, caiff yr haen TopoJSON a ddefnyddir ei "symleiddio" i gymhlethdod 1%% er mwyn cyflymder a hwyluso defnydd.

source: As an example a postcode sector topojson layer at 1%% is approx 900kb, full quality becomes 30Mb! Downloading and rendering, especially on mobile, is not advised unless absolutely necessary.
cy: Er enghraifft, mae haen topojson sector cod post ar 1%% tua 900kb, daw ansawdd llawn yn 30MB! Nid ydym yn argymell llwytho a chyfleu, yn arbennig ar ddyfais symudol oni bai fod hynny’n hollol angenrheidiol.

source: View <a href="https://github.com/mbloch/mapshaper/wiki/Command-Reference#-simplify" target="_blank"> Mapshaper "simplify"</a> for more information on the process of simplification used and <a href="https://en.wikipedia.org/wiki/Ramer%%E2%%80%%93Douglas%%E2%%80%%93Peucker_algorithm" target="_blank">Wikipedia Ramer-Douglas-Peucker</a> for information on the algorithm the process uses.
cy: Ewch i <a href="https://github.com/mbloch/mapshaper/wiki/Command-Reference#-simplify" target="_blank"> Mapshaper "simplify"</a> i gael rhagor o wybodaeth am y broses symleiddio a ddefnyddir a <a href="https://en.wikipedia.org/wiki/Ramer%%E2%%80%%93Douglas%%E2%%80%%93Peucker_algorithm" target="_blank">Wikipedia Ramer-Douglas-Peucker</a> gwybodaeth am yr algorithm y defnyddia’r broses.

source: Use High Resolution Regions
cy: Defnyddio Rhanbarthau Lliwiau Cryf

source: Institution/ Organisation
cy: Sefydliad

source: Area of Work
cy: Maes Gwaith

source: Comments
cy: Cynnwys

source: Qualitative Record
cy: Cofnod Ansoddol

source: Raw Text
cy: Testun Crai

source: Pages
cy: Tudalennau

source: Statistics
cy: Ystadegau

source: Errors
cy: Gwallau

source: Identifier
cy: Dynodwr

source: Dublin Core
cy: Craidd Dulyn

source: Creator
cy: Crëwr

source: Subject
cy: Pwnc

source: Description
cy: Disgrifiad

source: Publisher
cy: Cyhoeddwr

source: Contributor
cy: Cyfrannwr

source: Type
cy: Math

source: Format
cy: Fformat

source: Source
cy: Ffynhonnell

source: Relation
cy: Perthynas

source: Coverage
cy: Maint

source: Rights
cy: Hawliau

source: User ID
cy: Modd o Adnabod y Defnyddiwr

source: Created
cy: Crëwyd

source: Qualitative Record Details for :
cy: Manylion Cofnodi Ansoddol ar gyfer :

source: Qualitative Transcript Details
cy: Manylion Trawsgrifiad Ansoddol

source: Qualitative Transcript
cy: Trawsgrifiad Ansoddol

source: Transcript Coverage
cy: Faint o’r Trawsgrifiad a ddangosir

source: Question Detail
cy: Manylion Cwestiwn

source: Question
cy: Cwestiwn

source: Question ID
cy: Modd o Adnabod y cwestiwn

source: Question Text
cy: Testun y Cwestiwn

source: Question Number
cy: Rhif y Cwestiwn

source: Thematic Groups
cy: Grwpiu Themâu

source: Thematic Tags
cy: Tagiau Themâu

source: Link From
cy: Linc o

source: Sub Of
cy: Is-gymal

source: Question Type
cy: Math o Gwestiwn

source: Variable ID
cy: Modd Adnabod Amrywiadwy

source: Notes
cy: Nodiadau

source: user_id
cy: modd_adnabod y defnyddiwr

source: created
cy: crewyd

source: Last Edit
cy: Golygiad diwethaf

source: Response
cy: Ymateb

source: Response ID
cy: Modd Adnabod Ymateb

source: Response Text
cy: Testun Ymateb

source: Route Notes
cy: Nodiadau Llwybr

source: Table IDs
cy: Moddau Adnabod Tabl

source: Computed Variable
cy: Amrywiad wedi’i Gyfrifo

source: Response Type
cy: Math o Ymateb

source: Checks
cy: Gwiriadau

source: Route Type
cy: Math o Lwybr

source: View Survey
cy: Gweld yr Arolwg

source: Question Details for:
cy: Manylion Cwestiwn ar gyfer:

source: QuestionID
cy: Modd Adnabod y Cwestiwn

source: QuestionText
cy: Testun y Cwestiwn

source: Map Survey
cy: Arolwg

source: Jump to:
cy: Neidio i:

source: Survey Title
cy: Teitl yr Arolwg

source: View Question
cy: Gweld y Cwestiwn

source: Survey Results
cy: Canlyniadau’r Arolwg

source: Frequency
cy: Amlder

source: Collection Method
cy: Dull Casglu

source: Area
cy: Maes

source: Qualitative Results
cy: Canlyniadau Ansoddol

source: Tier
cy: Haen

source: Remote Data Search
cy: Chwilio Data o Bell

source: Map It
cy: Ei Fapio

source: Dataset ID
cy: Modd Adnabod Set Ddata

source: Dataset Type
cy: Math o Setiau Data

source: Search Query Options
cy: Opsiynau Ymholiadau Chwilio

source: Mapping colours
cy: Lliwiau’r map

source: Unique Identifier for this search
cy: Dynodwr unigryw ar gyfer y chwiliad hwn

source: Secondary Attributes
cy: Nodweddion Eilaidd

source: Toggle All/None
cy: Toglo’r Cyfan/Dim

source: Social Network Login Failure
cy: Methiant Mewngofnodi Rhwydwaith Cymdeithasol

source: An error occurred while attempting to login via your social network account.
cy: Roedd gwall wrth geisio mewngofnodi drwy eich cyfrif rhwydwaith cymdeithasol.

source: Account Connections
cy: Cysylltiadau Cyfrif

source: You can sign in to your account using any of the following third party accounts:
cy: Gallwch fewngofnodi i’ch cyfrif gan ddefnyddio unrhyw rai o’r cyfrifon trydydd parti a ganlyn:

source: You currently have no social network accounts connected to this account.
cy: Nid oes gennych unrhyw gyfrifon rhwydwaith cymdeithasol wedi’u cysylltu i’r cyfrif hwn ar hyn o bryd.

source: Add a 3rd Party Account
cy: Ychwanegu Cyfrif Trydydd Parti

source: Login Cancelled
cy: Mewngofnodi wedi’i ganslo

source: You decided to cancel logging in to our site using one of your existing accounts. If this was a mistake, please proceed to <a href="%(login_url)s">sign in</a>.
cy: Rydych wedi penderfynu canslo mewngofnodi i’n safle drwy ddefnyddio un o’ch cyfrifon cyfredol. Os mai camgymeriad oedd hyn, ewch i <a href="%(login_url)s">sign in</a>.

source: The social account has been connected.
cy: Mae’r cyfrif cymdeithasol wedi cael ei gysylltu.

source: The social account is already connected to a different account.
cy: Mae’r cyfrif cymdeithasol wedi’i gysylltu eisoes i gyfrif gwahanol.

source: The social account has been disconnected.
cy: Mae’r cyfrif cymdeithasol wedi cael ei ddatgysylltu.

source: You are about to use your %(provider_name)s account to login to %(site_name)s. As a final step, please complete the following form:
cy: Rydych ar fin defnyddio eich cyfrif %(provider_name)s i fewngofnodi %(site_name)s. Fel cam olaf, cwblhewch y ffurflen a ganlyn:

source: Sign in with Google
cy: Mewngofnodi gyda Google

source: Survey ID
cy: Modd adnabod yr Arolwg

source: Data Collector
cy: Casglwr Data

source: Collection Start Date
cy: Dyddiad Dechrau Casglu

source: Collection End Date
cy: Dyddiad Gorffen Casglu

source: Method of Collection Description
cy: Disgrifiad o’r Dull o Gasglu

source: Sampling Procedure
cy: Gweithdrefn Samplu

source: Collection Situation
cy: Sefyllfa Gasglu

source: Survey Frequency
cy: Amlder yr Arolwg

source: Survey Start Date
cy: Dyddiad Dechrau’r Arolwg

source: Survey End Date
cy: Dyddiad Gorffen yr Arolwg

source: Weighting
cy: Pwysoli

source: Sample Size
cy: Maint y Sampl

source: Response Rate
cy: Cyfradd Ymateb

source: Description Of Sampling Error
cy: Disgrifiad o’r Gwall Samplu

source: Data Product
cy: Cynnyrch Data

source: Data Product ID
cy: Modd Adnabod y Cynnyrch Data

source: Location
cy: Lleoliad

source: Updated
cy: Diweddarwyd

source: Long
cy: Hydredol

source: Short Title
cy: Teitl Byr

source: Spatial Data
cy: Data Gofodol

source: Creators
cy: Crëwyr

source: Subjects
cy: Pynciau

source: Publishers
cy: Cyhoeddwyr

source: Contributors
cy: Cyfranwyr

source: Source : URL
cy: Ffynhonnell : URL

source: Source : DOI
cy: Ffynhonnell : DOI

source: Relation : Same Collection
cy: Cysylltiad: Yr un Casgliad

source: Relation : Different Collection
cy: Cysylltiad: Casgliad Gwahanol

source: Coverage : Spatial
cy: Cwmpasiad: Gofodol

source: Coverage : Start Date
cy: Cwmpasiad : Dyddiad Dechrau

source: Coverage : End Date
cy: Cwmpasiad : Dyddiad Gorffen

source: Previous
cy: Blaenorol

source: Parent
cy: Rhiant

source: Survey Details for :
cy: Manylion Arolwg ar gyfer :

source: You have access to this {{ access_allow.document_type }} because you are a member of the "{{ access.survey_collection_user_group_name }}" group.
cy: Mae gennych fynediad at hwn {{ access_allow.document_type }} am eich bod yn aelod o grŵp "{{ access.survey_collection_user_group_name }}".

source: Please be aware that the information for "{{ access.survey_collection_name}}" has restricted access.
cy: Cofiwch bod y gallu i gael gafael ar wybodaeth am "{{ access.survey_collection_name}}" yn gyfyngedig.

source: Contact the WISERD DataPortal admin team for more information
cy: Cysylltwch â thîm gweinyddu WISERD DataPortal i gael rhagor o wybodaeth

source: Survey Metadata
cy: Metaddata’r Arolwg

source: From
cy: Gan

source: SubOf
cy: Is-gymal

source: Spatial Search
cy: Chwiliad Gofodol

source: View Details
cy: Golygu’r manylion

source: Spatial Search :
cy: Data Gofodol

source: Edit Search Name
cy: Chwilio o Bell

source: Details
cy: Golygu’r manylion

source: Spatial search area :
cy: Maes chwilio gofodol:

source: For on-screen help on each page of the DataPortal click this button.
cy: I gael cymorth ar y sgrîn ar bob tudalen o'r DataPortal cliciwch y botwm hwn.

source: Contents
cy: Cynnwys

source: The DataPortal
cy: Y DataPortal

source: Languages
cy: Ieithoedd

source: Creating an Account
cy: Creu Cyfrif

source: Navigating through The Dashboard
cy: Llywio drwy'r Dangosfwrdd

source: Searching for Data
cy: Metadata’r Arolwg

source: Using the Map
cy: Defnyddio'r Map

source: Adding data to the Map
cy: Ychwanegu data at y map

source: View Tech Blog Posts
cy: Gweld Negeseuon Blog Technegol

source: The WISERD DataPortal is a web application that enhances a researchers ability to search, discover, map and download socio-economic research data related to Wales. The aim is to encourage the re-use & repurposing of existing data.
cy: Mae DataPortal WISERD yn gymhwysiad gwe sy'n gwella gallu ymchwilydd i chwilio, darganfod, mapio a lawrlwytho data cymdeithasol-economaidd sy'n gysylltiedig â Chymru. Y nod yw annog ailddefnyddio ac ailbennu defnydd data presennol.

source: To access the WISERD DataPortal visit:
cy: I fynd at y DataPortal WISERD ewch i:

source: To find out more about the DataPortal project you can click on the WISERD button.
cy: I gael gwybod rhagor am y prosiect DataPortal gallwch glicio ar y botwm WISERD.

source: The DataPortal is available in both English and Welsh, to alternate between languages you can use the toggle buttons at the top of the page. You can find these buttons on each page of the DataPortal, which allows you to switch between languages whenever necessary.
cy: Mae'r DataPortal ar gael yn Gymraeg ac yn Saesneg, i symud rhwng y ddwy iaith gallwch ddefnyddio'r botymau toglo ar frig y dudalen. Mae'r botymau hyn ar bob tudalen o'r DataPortal, sy'n caniatau i chi newid rhwng ieithoedd pryd bynnag y bo angen.

source: You can also choose a language preference in your profile settings, which will be stored and used each time you log in.
cy: Gallwch hefyd ddewis eich dewis iaith yn eich gosodiadau proffil, fydd yn cael ei storio a'i ddefnyddio bob tro y byddwch yn mewngofnodi.

source: To use the full suite of DataPortal functionality you must first create an account using the Login button in the top right hand corner. You can either sign in straight away using an existing Google account, or create a new username and password.
cy: I ddefnyddio'r gyfres lawn o swyddogaethau'r DataPortal rhaid i chi greu cyfrif yn gyntaf gan ddefnyddio'r botwm Mewngofnodi ar y brig yn y gornel dde. Gallwch naill ai mewngofnodi yn syth gan ddefnyddio cyfrif Google sy'n bodoli eisoes, neu greu enw defnyddiwr a chyfrinair newydd.

source: Signing up to the Dataportal requires you to create a username and password, as well as providing an email address to verify your account.
cy: Mae cofrestru ar gyfer y DataPortal yn gofyn i chi greu enw defnyddiwr a chyfrinair, yn ogystal â darparu cyfeiriad e-bost i ddilysu eich cyfrif.

source: Once logged in you will be directed back to the Dashboard. From this page all sections of the DataPortal can be accessed using the buttons shown. The sidebar contains a dashboard button throughout the DataPortal, however, the logo at the top of the page can also be used to navigate back to the dashboard as well.
cy: Ar ôl i chi fewngofnodi cewch eich cyfeirio yn ôl at y dangosfwrdd. O'r dudalen hon gellir mynd at holl adrannau'r DataPortal gan ddefnyddio'r botymau a ddangosir. Mae'r bar ochr yn cynnwys botwm dangosfwrdd drwy gydol y DataPortal, fodd bynnag, gellir defnyddio'r logo ar frig y dudalen i lywio yn ôl ac ymlaen i'r dangosfwrdd hefyd.
