Repository: whelks-chance/wiserd3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: Blank
cy: Gwag

source: Account Inactive
cy: Cyfrif Segur

source: This account is inactive.
cy: Mae’r Cyfrif hwn yn segur

source: Account
cy: Cyfrif

source: E-mail Addresses
cy: Cyfeiriadau e-bost

source: The following e-mail addresses are associated with your account:
cy: Mae’r cyfeiriadau e-bost canlynol yn gysylltiedig â’ch cyfrif chi

source: Verified
cy: Dilyswyd

source: Unverified
cy: Heb ddilysu

source: Primary
cy: Prif

source: Make Primary
cy: Gwneud yn Brif

source: Re-send Verification
cy: Ail-anfon Dilysiad

source: Remove
cy: Dileu

source: Warning:
cy: Rhybudd:

source: You currently do not have any e-mail address set up. You should really add an e-mail address so you can receive notifications, reset your password, etc.
cy: Nid ydych wedi nodi cyfeiriad e-bost ar hyn o bryd. Dylech ychwanegu cyfeiriad e-bost fel y gallwch gael hysbysiadau, ailosod eich cyfrinair ac ati.

source: Add E-mail Address
cy: Ychwanegu Cyfeiriad e-bost

source: Add E-mail
cy: Ychwanegu e-bost

source: Do you really want to remove the selected e-mail address?
cy: A ydych chi wir am ddileu’r cyfeiriad e-bost sydd wedi’i ddewis?

source: Hello from %(site_name)s! You're receiving this e-mail because user %(user_display)s at %(site_domain)s has given yours as an e-mail address to connect their account. To confirm this is correct, go to %(activate_url)s
cy: Helo gan %(site_name)s! Anfonwyd y neges e-bost hon atoch am fod %(user_display)s yn %(site_domain)s wedi rhoi eich cyfeiriad e-bost chi ar gyfer cysylltu eu cyfrif. I gadarnhau hyn, ewch i %(activate_url)s

source: Thank you from %(site_name)s! %(site_domain)s
cy: Diolch, oddi wrth %(site_name)s! %(site_domain)s

source: Please Confirm Your E-mail Address
cy: Cadarnhewch eich Cyfeiriad e-bost

source: Hello from %(site_name)s! You're receiving this e-mail because you or someone else has requested a password for your user account at %(site_domain)s. It can be safely ignored if you did not request a password reset. Click the link below to reset your password.
cy: Helo gan %(site_name)s! Anfonwyd y neges e-bost hon atoch am eich bod chi neu rywun arall wedi gwneud cais am gyfrinair i’ch cyfrif defnyddiwr yn %(site_domain)s. Mae’n ddiogel i chi ei hanwybyddu os na wnaethoch gais i ailosod cyfrinair. Cliciwch y linc isod i ailosod eich cyfrinair.

source: In case you forgot, your username is %(username)s.
cy: Rhag ofn eich bod wedi anghofio, eich enw defnyddiwr yw %(username)s.

source: Thank you for using %(site_name)s! %(site_domain)s
cy: Diolch i chi am ddefnyddio %(site_name)s! %(site_domain)s

source: Password Reset E-mail
cy: E-bost Ailosod Cyfrinair

source: Confirm E-mail Address
cy: Cadarnhewch y Cyfeiriad e-bost

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an e-mail address for user %(user_display)s.
cy: Cadarnhewch bod <a href="mailto:%(email)s">%(email)s</a> yn gyfeiriad e-bost ar gyfer y defnyddiwr %(user_display)s.

source: Confirm
cy: Cadarnhau

source: This e-mail confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new e-mail confirmation request</a>.
cy: Mae’r linc hwn i gadarnhau e-bost wedi dod i ben neu mae’n annilys. Defnyddiwch <a href="%(email_url)s">i anfon cais newydd i gadarnhau e-bost</a>.

source: You have confirmed that <a href="mailto:%(email)s">%(email)s</a> is an e-mail address for user %(user_display)s.
cy: Rydych wedi cadarnhau bod <a href="mailto:%(email)s">%(email)s</a> yn gyfeiriad e-bost ar gyfer %(user_display)s.

source: Sign In
cy: Mewngofnodi

source: Please sign in with one of your existing third party accounts.
cy: Mewngofnodwch gydag un o’ch cyfrifon trydydd parti presennol.

source: If you have not created an account yet, then please <a href="%(signup_url)s">sign up</a> first.
cy: Os nad ydych wedi creu cyfrif eto, <a href="%(signup_url)s">cofrestrwch</a> yn gyntaf.

source: Or, <a href="%(signup_url)s">sign up</a> for a %(site_name)s account and sign in below:
cy: Neu, <a href="%(signup_url)s">cofrestrwch</a> i gael %(site_name)s cyfrif, a mewngofnodwch isod:

source: Forgot Password?
cy: Wedi anghofio’r Cyfrinair?

source: Sign Out
cy: Allgofnodi

source: Are you sure you want to sign out?
cy: Ydych chi’n siŵr eich bod am allgofnodi?

source: You cannot remove your primary e-mail address (%(email)s).
cy: Ni chewch ddileu eich prif gyfeiriad e-bost (%(email)s).

source: Confirmation e-mail sent to %(email)s.
cy: Anfonwyd e-bost cadarnhau at %(email)s.

source: You have confirmed %(email)s.
cy: Rydych wedi cadarnhau %(email)s.

source: Removed e-mail address %(email)s.
cy: Cyfeiriad e-bost a ddilewyd %(email)s.

source: Successfully signed in as %(name)s.
cy: Mewngofnodwyd yn llwyddiannus fel %(name)s.

source: You have signed out.
cy: Rydych wedi allgofnodi.

source: Password successfully changed.
cy: Newidwyd y cyfrinair yn llwyddiannus.

source: Password successfully set.
cy: Gosodwyd y cyfrinair yn llwyddiannus.

source: Primary e-mail address set.
cy: Gosodwyd y prif gyfeiriad e-bost.

source: Your primary e-mail address must be verified.
cy: Mae’n rhaid dilysu eich prif gyfeiriad e-bost.

source: Change Password
cy: Newid Cyfrinair

source: Password Reset
cy: Ailosod Cyfrinair

source: Forgotten your password? Enter your e-mail address below, and we'll send you an e-mail allowing you to reset it.
cy: Wedi anghofio eich cyfrinair? Rhowch eich cyfeiriad e-bost isod, a byddwn yn anfon e-bost atoch yn caniatáu i chi ei ailosod.

source: Reset My Password
cy: Ailosod fy Nghyfrinair

source: Please contact us if you have any trouble resetting your password.
cy: Cysylltwch â ni os cewch unrhyw drafferth yn ailosod eich cyfrinair.

source: We have sent you an e-mail. Please contact us if you do not receive it within a few minutes.
cy: Rydym wedi anfon neges e-bost atoch. Cysylltwch â ni os nad yw wedi cyrraedd o fewn ychydig funudau.

source: Bad Token
cy: Tocyn Gwael

source: The password reset link was invalid, possibly because it has already been used. Please request a <a href="%(passwd_reset_url)s">new password reset</a>.
cy: Roedd y linc ailosod cyfrinair yn annilys, efallai am ei fod wedi ei ddefnyddio eisoes. Gwnewch gais i <a href="%(passwd_reset_url)s">ailosod cyfrinair newydd</a>.

source: change password
cy: newid cyfrinair

source: Your password is now changed.
cy: Mae eich cyfrinair wedi newid.

source: Set Password
cy: Gosod y Cyfrinair

source: Signup
cy: Cofrestru

source: Sign Up
cy: Cofrestru

source: Already have an account? Then please <a href="%(login_url)s">sign in</a>.
cy: Cyfrif yn barod? <a href="%(login_url)s">mewngofnodwch</a>.

source: Sign Up Closed
cy: Cofrestru ynghau

source: We are sorry, but the sign up is currently closed.
cy: Ymddiheuriadau, ond mae cofrestru ynghau ar hyn o bryd.

source: Note
cy: Nodyn

source: you are already logged in as %(user_display)s.
cy: rydych wedi mewngofnodi eisoes fel %(user_display)s.

source: Verify Your E-mail Address
cy: Dilyswch eich Cyfeiriad e-bost

source: We have sent an e-mail to you for verification. Follow the link provided to finalize the signup process. Please contact us if you do not receive it within a few minutes.
cy: Rydym wedi anfon neges e-bost atoch ar gyfer dilysu. Dilynwch y linc ynddi i gwblhau’r broses gofrestru. Cysylltwch â ni os na fydd yn cyrraedd o fewn ychydig funudau.

source: This part of the site requires us to verify that you are who you claim to be. For this purpose, we require that you verify ownership of your e-mail address.
cy: Yn y rhan hon o’r safle, mae angen inni ddilysu mai chi ydych chi. I wneud hyn, mae’n rhaid inni ofyn ichi ddilysu perchnogaeth eich cyfeiriad e-bost.

source: We have sent an e-mail to you for verification. Please click on the link inside this e-mail. Please contact us if you do not receive it within a few minutes.
cy: Rydym wedi anfon neges e-bost atoch er mwyn dilysu. Cliciwch ar y linc yn y neges e-bost hon. Cysylltwch â ni os na fydd yn cyrraedd o fewn ychydig funudau.

source: <strong>Note:</strong> you can still <a href="%(email_url)s">change your e-mail address</a>.
cy: <strong>Nodyn:</strong> gallwch <a href="%(email_url)s">newid eich cyfeiriad e-bost o hyd</a>.

source: Help and Support
cy: Help a Chymorth

source: This page provides help and support to you while using the DataPortal
cy: HERE IS SOME WELSH TEXT

source: User Guide
cy: Canllaw Defnyddiwr

source: If you need more assistance than these tip boxes here is the link to a detailed user help guide.
cy: Os oes angen

source: The Experts
cy: Yr Arbenigwyr

source: If you have questions or need more support please contact the experts.
cy: Os oes gennych unrhyw gwestiynau neu os oes angen rhagor o gymorth arnoch cysylltwch â'r arbenigwyr.

source: Useful Links
cy: Lincs Defnyddiol

source: Please find links related to the DataPortal here.
cy: Mae'r lincs sy'n ymwneud â'r DataPortal yma.

source: Question Metadata
cy: Metaddata Cwestiwn

source: This tab shows metadata for the selected question
cy: Mae'r tab hwn yn dangos y metadata ar gyfer y cwestiwn a ddewiswyd.

source: Response Metadata
cy: Metadata Ymateb

source: This tab shows metadata for the selected response
cy: Mae'r tab hwn yn dangos y metadata ar gyfer yr ymateb a ddewiswyd.

source: Response Table
cy: Tabl Ymateb

source: This button shows the Response Table for the question.
cy: Mae'r botwm hwn yn dangos y Tabl Ymateb ar gyfer y cwestiwn.

source: This shows a table of valid responses to the questions, along with the variable used to record it.
cy: Mae hwn yn dangos tabl o ymatebion dilys i'r cwestiynau, ynghyd â'r newidyn a ddefnyddiwyd i'w gofnodi.

source: Browse Surveys
cy: Arolygon

source: This page allows you to browse all the surveys available.
cy: Mae'r dudalen hon yn gadael i chi bori drwy'r holl arolygon sydd ar gael.

source: Filter
cy: Hidlo

source: You can filter the table of surveys using key words.
cy: Gallwch hidlo'r tabl o arolygon yn defnyddio geiriau allweddol.

source: View
cy: Gweld

source: This button allows you to choose the number of surveys you view per page.
cy: Mae'r botwm hwn yn caniatau i chi ddewis nifer yr arolygon yr ydych yn eu gweld ar bob tudalen.

source: Select category type
cy: Dewis math o gategori

source: This will change the distribution of data. Use Quantiles by default
cy: Bydd hyn yn newid dosbarthiad y data. Defnyddiwch Gwantiliau yn ddiofyn

source: Select number of categories
cy: Dewis nifer y categorïau

source: This will be the number of categories your data is divided into
cy: Dyma fydd nifer y categorïau y caiff eich data eu rhannu iddynt

source: Select Colour scheme
cy: Dewis cynllun lliwiau

source: Select the colour range of your data
cy: Dewiswch amrediad lliw eich data

source: Name it
cy: Enwch ef

source: This name will appear on the map key
cy: Bydd yr enw hwn yn ymddangos ar allwedd y map

source: Search
cy: Chwilio

source: Enter a keyword to search for surveys.
cy: Nodwch air allweddol i chwilio am arolygon.

source: Variables
cy: Newidynnau

source: Make sure to select a variable from each section.
cy: Gwnewch yn siwr eich bod yn dewis newidyn o bob adran.

source: Drop a file
cy: Gollwng ffeil

source: Use your own data file. Drag-and-drop it here.
cy: Defnyddiwch eich ffeil data eich hun. Llusgwch a gollyngwch hi yma.

source: Select file from filesystem
cy: Dewiswch y ffeil o'r system ffeiliau.

source: Search for your file by clicking here.
cy: Chwiliwch am eich ffeil drwy glicio yma.

source: Geography column
cy: Colofn ddaearyddiaeth

source: Pick the geography ID of your data.
cy: Dewiswch ddynodydd daearyddol eich data.

source: Data value
cy: Gwerth data

source: Pick the data values you want mapped.
cy: Dewiswch y gwerthoedd data yr ydych am eu mapio.

source: Any other data to display
cy: Unrhyw ddata eraill i'w dangos.

source: This will be displayed in the sidebar when clicking on the map later.
cy: Bydd hyn yn cael ei ddangos yn y bar ochr wrth glicio ar y map yn ddiweddarach.

source: Change language
cy: Newid Iaith

source: These buttons can be used to toggle the language the site displays in.<br><br>If you sign-up and login, this preference will be stored for future visits.
cy: Gellir defnyddio'r botymau hyn i doglo'r iaith y mae'r wefan yn dangos ynddi. <br><br>Os byddwch yn cofrestru ac yn mewngofnodi, bydd y dewis hwn yn cael ei gadw ar gyfer ymweliadau yn y dyfodol.

source: The Map
cy: Y Map

source: The Map is the primary focus here.<br><br>Layers of data are displayed, and most can be selected to show further detail.
cy: Y Map yw'r prif ffocws yma.<br><br>Mae haenau o ddata yn cael eu dangos, a gellir dewis y rhan fwyaf ohonynt i ddangos manylion pellach.

source: Legend
cy: Eglurhad

source: Once data layers have been added, the legend will be displayed here.<br><br>Colours and the number of categories are selected when the layer is first added.
cy: Ar ôl i haenau data gael eu hychwanegu, bydd yr eglurhad yn cael ei ddangos yma.<br><brDewisir lliwiau a nifer y categorïau pan gaiff yr haen gyntaf ei hychwanegu.

source: Side menu
cy: Dewislen ochr

source: <p>This is where new map layers are added.</p><h4>RemoteData</h4><p>Import data from Nomis and/or StatsWales</p><h4>MapMyData</h4><p>Upload an Excel file with geographies and values for mapping</p><h4>Welsh Government Data</h4><p>WMS layers made available by LLE, Welsh Government</p>
cy: <p>Dyma lle mae haenau map newydd yn cael eu hychwanegu.</p><h4>Dataobell</h4><p>Mewnforio data o Nomis a/neu YstadegauCymru</p><h4>MapiofyNata</h4><p>Llwytho ffeil Excel file gyda daearyddiaethau a gwerthoedd i'w mapio</p><h4>Data Llywodraeth Cymru </h4><p>Haenau WMS ar gael gan LLE, Llywodraeth Cymru</p>

source: Info Pane
cy: Panel Gwybodaeth

source: When regions on the map are selected, the corresponding data for that area are shown here
cy: Pan gaiff rhanbarthau ar y map eu dethol, mae'r data cyfatebol ar gyfer yr ardal honno yn cael eu dangos yma.

source: These buttons can be used throughout the website to toggle the language the site displays in.<br><br>If you sign-up and login, this preference will be stored for future visits.
cy: Gellir defnyddio'r botymau hyn ar draws y wefan i doglo'r iaith y mae'r wefan yn cael ei dangos ynddi. .<br><br>Os byddwch yn cofrestru ac yn mewngofnodi, bydd y dewis hwn yn cael ei storio ar gyfer ymweliadau yn y dyfodol.

source: The Dashboard
cy: Dangosfwrdd

source: These buttons take you to different sections of the DataPortal
cy: Mae'r botymau hyn yn mynd â chi i wahanol adrannau'r DataPortal.

source: Side Menu
cy: Dewislen Ochr

source: This menu appears on all DataPortal pages. Go directly to the mapping page or browse recent search results.
cy: Mae'r ddewislen hon yn ymddangos ar holl dudalennau'r DataPortal. Ewch yn syth i'r dudalen fapio neu porwch ganlyniadau chwilio diweddar.

source: Events and Presentations
cy: Digwyddiadau a Chyflwyniadau

source: Welcome to the events page, here you can find out about events that the DataPortal team will be attending as well as the accompanying presentations.
cy: Croeso i'r dudalen digwyddiadau, yma gallwch weld y digwyddiadau y bydd aelodau'r tîm DataPortal yn mynd iddynt yn ogystal â'r cyflwyniadau cysylltiedig.

source: Downloadable content
cy: Cynnwys y gellir ei lawrlwytho

source: The presentation can be downloaded via this link.
cy: Gellir lawrlwytho'r cyflwyniad drwy'r linc hwn.

source: Jump to Questions
cy: Mynd i'r Cwestiynau

source: This button shows the questions discovered during the search.
cy: Mae'r botwm hwn yn dangos y cwestiynau a gafwyd yn ystod y chwiliad.

source: Question table
cy: Tabl Cwestiynau

source: This shows the questions discovered during the search.
cy: Mae hwn yn dangos y cwestiynau a gafwyd yn ystod y chwiliad.

source: Jump to Surveys
cy: Arolygon

source: This button shows the surveys discovered during the search.
cy: Mae'r botwm hwn yn dangos yr arolygon a gafwyd yn ystod y chwiliad.

source: Survey table
cy: Tabl yr Arolwg

source: This shows the surveys discovered during the search.
cy: Mae hwn yn dangos yr arolygon a gafwyd yn ystod y chwiliad.

source: Jump to Qualitative records
cy: Mynd i'r Cofnodion Ansoddol

source: This button shows the Qualitative records discovered during the search.
cy: Mae'r botwm hwn yn dangos y cofnodion Ansoddol y cafwyd hyd iddynt yn ystod y chwiliad.

source: Qualitative Records
cy: Cofnodion Ansoddol

source: This shows the Qualitative records discovered during the search.
cy: Mae hwn yn dangos y cofnodion Ansoddol y cafwyd hyd iddynt yn ystod y chwiliad.

source: Search box
cy: Bocs chwilio

source: Data can be searched here. This shows the current search, and can be modified or refined to search again.
cy: Gellir chwilio am ddata yma. Mae hwn yn dangos y chwiliad cyfredol, a gellir ei addasu neu ei fireinio i chwilio eto.

source: Filter searches to refine the results.
cy: Hidlo'r chwiliadau i fireinio'r canlyniadau.

source: Dublin Core Tab
cy: Tab Craidd Dulyn

source: This button shows the Dublin Core data.
cy: Mae'r botwm hwn yn dangos data Craidd Dulyn.

source: This has standardised data focussing on the collection and repository of the Survey data.
cy: Mae data safonol yn hwn sy'n canolbwyntio ar gasglu a storio data'r Arolwg.

source: Download
cy: Lawrlwytho

source: Data url
cy: Url Data

source: Survey Tab
cy: Tab Arolwg

source: This button shows the WISERD Survey Metadata.
cy: Mae'r botwm hwn yn dangos Metadata Arolwg WISERD.

source: This has WISERD metadata specific to the interests of the Social Sciences.
cy: Mae gan hwn fetadata WISERD sy'n benodol i ddiddordebau'r Gwyddorau Cymdeithasol.

source: Survey Questions Tab
cy: Tab Cwestiynau'r Arolwg

source: This button shows the surveys questions.
cy: Mae'r botwm hwn yn dangos cwestiynau'r arolwg.

source: This has the questions from the survey.
cy: Mae'r cwestiynau o'r arolwg yn hwn.

source: Sorry, an error occurred. Please try again, or report it.
cy: Mae’n ddrwg gennym, cafwyd gwall. Rhowch gynnig arall arni, neu rhowch wybod amdano.

source: Fetching map layer...
cy: Casglu haen map...

source: Inspecting dataset ...
cy: Archwilio setiau data ...

source: Filter :
cy: Hidlwr:

source: Display
cy: Dangos

source: All
cy: Pob un

source: records
cy: Cofnodion

source: Title
cy: Teitl

source: Date
cy: Dyddiad

source: Top
cy: Brig

source: Survey
cy: Arolwg

source: Dashboard
cy: Dangosfwrdd

source: Search Metadata
cy: Metaddata’r Arolwg

source: Mapping tools
cy: Offer Mapio

source: View Map
cy: Gweld y Map

source: National Assembly for Wales
cy: Cynulliad Cenedlaethol Cymru

source: Senedd Research
cy: Ymchwil y Senedd

source: Welsh Parliament
cy: Senedd Cymru

source: Events
cy: Digwyddiadau

source: Event Presentation Files
cy: Ffeiliau Cyflwyno Digwyddiad

source: About, Help and Support
cy: Gwybodaeth, Help a Chymorth

source: Tech Blog
cy: Blog Technegol

source: View DataPortal technical developments
cy: Ewch i ddatblygiadau technegol y DataPortal

source: WISERD DataPortal Homepage
cy: Hafan DataPortal WISERD

source: Profile
cy: Proffil

source: View Profile
cy: Gweld Proffil

source: File Management
cy: Rheoli Ffeiliau

source: Shapefile Upload
cy: Llwytho Shapefile

source: My Data and History
cy: Fy Nata a'm Hanes

source: Searches
cy: Chwiliadau

source: Search Title
cy: Teitl y Chwiliad

source: Search Type
cy: Math y Chwiliad

source: Download the presentation here :
cy: Llwythwch y cyflwyniad yma :

source: link
cy: linc

source: ESRC Festival of Social Science 2015 – WISERD DataPortal demonstration
cy: Gŵyl Gwyddor Gymdeithasol 2015 y Cyngor Ymchwil Economaidd a Chymdeithasol – Dangos WISERD DataPortal

source: 11th November 2015
cy: 11 Tachwedd 2015

source: Upload ShapeFile
cy: Llwytho ShapeFile

source: Submit
cy: Cyflwyno

source: Uploaded Files
cy: Llwytho Ffeiliau

source: Download or view Usage Guide here
cy: Llwytho neu weld y Canllaw Defnyddio yma

source: Licence and Attribution
cy: Nodweddion Eilaidd

source: The information on usage of WISERD metadata, data and data from other external sources is available <a href=%(licence_attribution_url)s>here</a>.
cy: Mae gwybodaeth am ddefnyddio metadata a data WISERD a data o ffynonellau allanol ar gael <a href=%(licence_attribution_url)s>yma</a>.

source: Support
cy: Cymorth

source: Contact Us
cy: Cysylltwch â ni

source: Contact WISERD
cy: Cysylltwch â WISERD

source: Scott Orford, Project PI : OrfordS (at) cardiff.ac.uk
cy: Scott Orford, Prif Ymchwilydd y Prosiect : OrfordS (yn) cardiff.ac.uk

source: Ian Harvey, Lead Software Engineer/ Developer: HarveyIC (at) cardiff.ac.uk
cy: Ian Harvey, Prif Beiriannydd / Ddatblygwr Meddalwedd: HarveyIC (yn) cardiff.ac.uk

source: Sam Jones, Research Technician : JonesS97 (at) cardiff.ac.uk
cy: Sam Jones, Technegydd Ymchwil : JonesS97 (yn) cardiff.ac.uk

source: Change Log
cy: Newid y Log

source: December 2nd, 2013
cy: 2 Rhagfyr 2013

source: Tidying up for development hiatus
cy: Twtio yn ystod bwlch yn y gwaith datblygu

source: Addition of this information to welcome screen (data taken from github commit logs)
cy: Ychwanegu’r wybodaeth hon i’r sgrin groeso (data o logiau ymrwymo github)

source: Bug fixes
cy: Cywiro bygiau

source: November 13th, 2013
cy: 13 Tachwedd 2013

source: Reads and displays response tables from database metadata
cy: Mae’n darllen a dangos tablau ymateb o fetaddata cronfa ddata

source: Increase metadata access through linking of orphaned metadata IDs
cy: Cynyddu mynediad at fetadata drwy gysylltu dulliau adnabod metaddata amddifad

source: Early stages of ONS API integration
cy: Camau cyntaf integreiddio API Swyddfa Ystadegau Gwladol

source: October 7th, 2013
cy: 7 Hydref 2013

source: Huge update to database access security and speed
cy: Diweddariad anferth i ddiogelwch a chyflymder mynediad at y gronfa ddata

source: Qualitative data tagging added to Data Entry tools
cy: Tagio data ansoddol wedi’i ychwanegu at yr offer Cofnodi Data

source: Review of APIs used to generate Qual metadata
cy: Defnyddio adolygiad o API i gynhyrchu metaddata ansoddol

source: Increase database continuity and metadata mapping connectivity
cy: Cynyddu parhad y gronfa ddata a chysylltedd mapio metaddata

source: August 6th, 2013
cy: 6 Awst 2013

source: New Data Entry toolkit developed and embedded within the DataPortal
cy: Datblygwyd a gwreiddwyd offer Cofnodi Data newydd yn y DataPortal

source: User and Project Management GUI panel added
cy: Ychwanegwyd panel GUI Defnyddwyr a Rheolwyr y Prosiect

source: Yii RBAC (role based access control) added to the back-end
cy: Ychwanegwyd RBAC Yii (dull rheoli mynediad ar sail rôl) i’r cefn

source: June 4th, 2013
cy: 4 Mehefin 2013

source: Database query efficiencies
cy: Effeithlonrwydd ymholiadau’r gronfa ddata

source: Remote data from Neighbourhood Statistics
cy: Data o bell o Ystadegau’r Gymdogaeth

source: Updates to advanced search speed, relevance and pagination of results
cy: Diweddariad i gyflymder, perthnasedd a thudaleniad canlyniadau chwilio uwch

source: Analysis of Database consistency issues
cy: Dadansoddiad o faterion cysondeb y gronfa ddata

source: April 12th, 2013
cy: 12 Ebrill 2013

source: GeoPortal -&gt; DataPortal rebranding
cy: GeoPortal -&gt; ailfrandio DataPortal

source: Increased brower compatibility
cy: Mwy o gydnawsedd porwr

source: Bug report and sign-up emails
cy: Negeseuon e-bost cofnodi bygiau a negeseuon cofrestru

source: Advanced search added
cy: Ychwanegwyd gallu chwilio uwch

source: Remote data feed from NomisWeb added
cy: Ychwanegwyd ffrwd data o bell o NomisWeb

source: Matching of local WISERD metadata to remote datasets
cy: Cydweddu metaddata WISERD lleol i’r setiau data o bell

source: SLD layer icons and legend creation and rendering
cy: Ficonau haen SLD a chreu eglurhad a rendro

source: Feb 16th, 2013
cy: 16 Chwefror 2013
